Revit 2024 API
ExtElemChangeBeamSectionRegistry Methods
The ExtElemChangeBeamSectionRegistry type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
RegisterInterface
 Registers a IExtElemChangeBeamSection
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Unregister
 Unregisters IExtElemChangeBeamSection.
See Also
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace